# -*- 'coding',: 'UTF',-'8', -*-




court_list = {'zhongji':'',
              'chengdu':'',
              'zigong':'',
              'panzhihua':'',
              'luzhou':'',
              'deyang':'',
              'mianyang':'',
              'guangyuan':'',
              'shuining':'',
              'neijiang':'',
              'leshan':'',
              'nanchong':'',
              'meishan':'',
              'yibing':'',
              'guangan':'',
              'dazhou':'',
              'yaan':'',
              'bazhong':'',
              'ziyang':'',
              'wenchuan':'',
              'kangding':'',
              'xichang':'',
              'tielu':''}

court_list['zhongji'] = ['成都市中级人民法院',
                         '自贡市中级人民法院',
                         '攀枝花市中级人民法院',
                         '泸州市中级人民法院',
                         '德阳市中级人民法院',
                         '绵阳市中级人民法院',
                         '广元市中级人民法院',
                         '遂宁市中级人民法院',
                         '内江市中级人民法院',
                         '乐山市中级人民法院',
                         '南充市中级人民法院',
                         '眉山市中级人民法院',
                         '宜宾市中级人民法院',
                         '广安市中级人民法院',
                         '达州市中级人民法院',
                         '雅安市中级人民法院',
                         '巴中市中级人民法院',
                         '资阳市中级人民法院',
                         '阿坝藏族羌族自治州中级人民法院',
                         '甘孜藏族自治州中级人民法院',
                         '凉山彝族自治州中级人民法院',
                         '成都铁路运输中级法院']


court_list['chengdu'] = ['成都市锦江区人民法院',
'成都市青羊区人民法院',
'成都市金牛区人民法院',
'成都市武侯区人民法院',
'成都市成华区人民法院',
'成都市龙泉驿区人民法院',
'成都市青白江区人民法院',
'成都市温江区人民法院',
'金堂县人民法院',
'成都市双流区人民法院',
'郫县人民法院',
'大邑县人民法院',
'蒲江县人民法院',
'新津县人民法院',
'都江堰市人民法院',
'彭州市人民法院',
'邛崃市人民法院',
'崇州市人民法院',
'成都高新技术产业开发区人民法院']

court_list['zigong'] = ['自贡市自流井区人民法院',
'自贡市贡井区人民法院',
'自贡市大安区人民法院',
'自贡市沿滩区人民法院',
'荣县人民法院',
'富顺县人民法院']

court_list['panzhihua'] = ['攀枝花市东区人民法院',
'攀枝花市西区人民法院',
'攀枝花市仁和区人民法院',
'米易县人民法院',
'盐边县人民法院']

court_list['luzhou'] = ['泸州市江阳区人民法院',
'泸州市纳溪区人民法院',
'泸州市龙马潭区人民法院',
'泸县人民法院',
'合江县人民法院',
'叙永县人民法院',
'古蔺县人民法院']

court_list['deyang'] = ['德阳市旌阳区人民法院',
'中江县人民法院',
'罗江县人民法院',
'广汉市人民法院',
'什邡市人民法院',
'绵竹市人民法院']

court_list['mianyang'] = ['绵阳市涪城区人民法院',
'绵阳市游仙区人民法院',
'三台县人民法院',
'盐亭县人民法院',
'绵阳市安州区人民法院',
'梓潼县人民法院',
'北川羌族自治县人民法院',
'平武县人民法院',
'江油市人民法院',
'四川省科学城人民法院',
'绵阳高新技术产业开发区人民法院']

court_list['guangyuan'] = ['广元市利州区人民法院',
'广元市昭化区人民法院',
'广元市朝天区人民法院',
'旺苍县人民法院',
'青川县人民法院',
'剑阁县人民法院',
'苍溪县人民法院']

court_list['shuining'] = ['遂宁市船山区人民法院',
'遂宁市安居区人民法院',
'蓬溪县人民法院',
'射洪县人民法院',
'大英县人民法院']

court_list['neijiang'] = ['内江市市中区人民法院',
'内江市东兴区人民法院',
'威远县人民法院',
'资中县人民法院',
'隆昌县人民法院']

court_list['leshan'] = ['乐山市市中区人民法院',
'乐山市沙湾区人民法院',
'乐山市五通桥区人民法院',
'乐山市金口河区人民法院',
'犍为县人民法院',
'井研县人民法院',
'夹江县人民法院',
'沐川县人民法院',
'峨边彝族自治县人民法院',
'马边彝族自治县人民法院',
'峨眉山市人民法院']


court_list['nanchong'] = ['南充市顺庆区人民法院',
'南充市高坪区人民法院',
'南充市嘉陵区人民法院',
'南部县人民法院',
'营山县人民法院',
'蓬安县人民法院',
'仪陇县人民法院',
'西充县人民法院',
'阆中市人民法院']


court_list['meishan'] = ['眉山市东坡区人民法院',
'眉山市彭山区人民法院',
'仁寿县人民法院',
'洪雅县人民法院',
'丹棱县人民法院',
'青神县人民法院']

court_list['yibing'] = ['宜宾市翠屏区人民法院',
'宜宾市南溪区人民法院',
'宜宾县人民法院',
'江安县人民法院',
'长宁县人民法院',
'高县人民法院',
'珙县人民法院',
'筠连县人民法院',
'兴文县人民法院',
'屏山县人民法院']

court_list['guangan'] = ['广安市广安区人民法院',
'广安市前锋区人民法院',
'岳池县人民法院',
'武胜县人民法院',
'邻水县人民法院',
'华蓥市人民法院']

court_list['dazhou'] = ['达州市通川区人民法院',
'达州市达川区人民法院',
'宣汉县人民法院',
'开江县人民法院',
'大竹县人民法院',
'渠县人民法院',
'万源市人民法院']

court_list['yaan'] = ['雅安市雨城区人民法院',
'雅安市名山区人民法院',
'荥经县人民法院',
'汉源县人民法院',
'石棉县人民法院',
'天全县人民法院',
'芦山县人民法院',
'宝兴县人民法院']

court_list['bazhong'] = ['巴中市巴州区人民法院',
'巴中市恩阳区人民法院',
'通江县人民法院',
'南江县人民法院',
'平昌县人民法院']

court_list['ziyang'] = ['资阳市雁江区人民法院',
'安岳县人民法院',
'乐至县人民法院',
'简阳市人民法院']

court_list['wenchuan'] = ['汶川县人民法院',
'理县人民法院',
'茂县人民法院',
'松潘县人民法院',
'九寨沟县人民法院',
'金川县人民法院',
'小金县人民法院',
'黑水县人民法院',
'马尔康市人民法院',
'壤塘县人民法院',
#'阿坝县人民法院',
'若尔盖县人民法院',
'红原县人民法院']

court_list['kangding'] = ['康定市人民法院',
'泸定县人民法院',
'丹巴县人民法院',
'九龙县人民法院',
'雅江县人民法院',
'道孚县人民法院',
'炉霍县人民法院',
'甘孜县人民法院',
'新龙县人民法院',
'德格县人民法院',
'白玉县人民法院',
'石渠县人民法院',
'色达县人民法院',
'理塘县人民法院',
'巴塘县人民法院',
'乡城县人民法院',
'稻城县人民法院',
'得荣县人民法院']

court_list['xichang'] = ['西昌市人民法院',
'木里藏族自治县人民法院',
'盐源县人民法院',
'德昌县人民法院',
'会理县人民法院',
'会东县人民法院',
'宁南县人民法院',
'普格县人民法院',
'布拖县人民法院',
'金阳县人民法院',
'昭觉县人民法院',
'喜德县人民法院',
'冕宁县人民法院',
'越西县人民法院',
'甘洛县人民法院',
'美姑县人民法院',
'雷波县人民法院']

court_list['tielu'] = ['成都铁路运输法院',
'西昌铁路运输法院']

zm_group_list = ['sq_list', 'jtzs_wxjs_list', 'jysxzmdqt_list', 'twhl_list', 
                 'scxswlsp_list', 'dpfz_list', 'dq_list', 'qjie_list', 'qjian_list', 'qduo_list',
                 'gysr_list', 'gysh_list', 'ffjj_list', 'ksdc_list', 'cx_list',
                 'jzdo_xxzs_list', 'dflm_list', 'zp_list', 'fx_list','zzjsmy_list',
                 'qt_list'] 






zm_group_name = {'sq_list':'涉枪犯罪',
                 'jtzs_wxjs_list':'交通肇事和危险驾驶', 
                 'jysxzmdqt_list':'具有死刑罪名的其他', 
                 'twhl_list':'贪污贿赂', 
                 'scxswlsp_list':'生产销售伪劣商品', 
                 'dpfz_list':'毒品犯罪',
                 'dq_list':'盗窃',
                 'qjie_list':'抢劫',
                 'qduo_list':'抢夺',
                 'qjian_list':'强奸',
                 'gysr_list':'故意杀人',
                 'gysh_list':'故意伤害',
                 'ffjj_list':'非法拘禁',
                 'ksdc_list':'开设赌场',
                 'cx_list':'传销',
                 'jzdo_xxzs_list':'聚众斗殴和寻衅滋事',
                 'dflm_list':'盗伐林木',
                 'zp_list':'诈骗',
                 'fx_list':'非法吸收公众存款',
                 'zzjsmy_list':'组织介绍卖淫',
                 'qt_list':'其他'}
                 
                 

zm_group = {}


zm_group['fx_list'] = ['非法吸收公共存款', '非法吸收公众存款']
zm_group['dq_list'] = ['盗窃']
zm_group['qjie_list'] = ['抢劫']
zm_group['qduo_list'] = ['抢夺']
zm_group['qjian_list'] = ['强奸']
zm_group['gysh_list'] = ['故意伤.', '故意伤害', '伤害']
zm_group['gysr_list'] = ['故意杀人']
zm_group['ffjj_list'] = ['非法拘禁']
zm_group['ksdc_list'] = ['开设赌场', '开赌场']
zm_group['cx_list'] = ['传销', '组织、领导传销活动']

# 其他
zm_group['qt_list'] = ['走私珍贵动物制品',
                       '走私普通货物、物品',
                       '走私普通物品',
                      '出售非法制造的发票',
                      '虚假广告',
                      '挪用特定款物',
                      '重大劳动安全事故',
                      '扰乱法庭秩序',
                      '聚众扰乱(社会|公共场所|交通)?秩序',
                      #'聚众扰乱社会秩序',
                      #'聚众扰乱交通秩序',
                      #'聚众扰乱秩序',
                      '虚开用于抵扣税款发票',
                      '私分国有资产',
                      '利用封建迷信致人死亡',
                      '徇私舞弊暂予监外执行',
                      '盗掘古文化遗址',
                      '非法获取公民个人信息',
                      '出售、非法提供公民个人信息',
                      '非法处置冻结的财产',
                      '持有伪造的发票',
                      '拒不执行(人民)?(法院)?判决',
                      '帮助毁灭伪造证据',
                      '过失致人重',
                      '帮助(伪造|毁灭)证据',
                      '偷越国境',
                      #'非法毁坏国家重点保护植物',
                      '非法(毁坏|采伐|运输)国家重点保护植物',
                      '非法收购、运输、出售国家重点保护植物',
                      #'非法采伐国家重点保护植物',
                      '非法收购、运输国家重点保护植物',
                      '非法(出售|收购)国家重点保护植物',
                      #'非法收购国家重点保护植物',
                      '违法发放贷款',
                      '非法提供信用卡信息',
                      '倒卖文物',
                      '伪造金融票证',
                      '聚众哄抢',
                      #'非法(收购|猎捕)珍贵、濒危野生动物',
                      #'非法收购、出售珍贵、濒危野生动物',
                      '侵占',
                      '环境污染',
                      '持有、使用假币',
                      '聚众淫乱',
                      '侮辱',
                      '抽逃出资',
                      '巨额财产来源不明',
                      '收买、非法提供信用卡信息',
                      '提供侵入、非法控制计算机信息系统程序、工具',
                      '虚开抵扣税款发票',
                      #'',
                      '虚开发票',
                      '脱逃',
                      '伪造、变造国家机关公文',
                      '(伪造|买卖)(国家机关|武装部队)(印章|证件|公文)',
                      '伪造国家机关证件、印章',
                      '非法侵入他人住宅',
                      '倒卖车票',
                      '敲诈勒索',
                      #'伪造武装部队印章',
                      '(毁|损)坏(公私)?财物',
                      '职务侵占',
                      '非法侵入住宅',
                      '买卖身份证件',
                      '替考',
                      '妨(害|碍)公务',
                      '行贿',
                      '隐瞒(犯罪)?所得',
                      '过失致人(死亡|重伤)',
                      '污染环境',
                      '赌博',
                      '重大责任事故',
                      '.造.*(印章|证件)',
                      '伪造居民身份证',
                      '伪造货币',
                      '(购买|持有)假币',
                      '失火',
                      '拒不支付劳动报酬',
                      '猥亵',
                      '非法获取国家秘密',
                      '玩忽职守',
                      '滥用职权',
                      '重婚',
                      '假冒注册商标',
                      '破坏电力设备',
                      '挪用公款',
                      '非法经营',
                      '串通投标',
                      '(出售|购买|运输)假币',
                      '挪用资金',
                      '非法行医',
                      '招摇撞骗',
                      '冒充军人招摇撞骗',
                      '强迫交易',
                      '传播淫秽物品牟利',
                      '..尸体',
                      '销售非法制造的注册商标标识',
                      '拒不(执|履)行判决',
                      '窝藏',
                      '非法占(有|用)农用地',
                      '非法占用农用地',
                      '破坏公用电信设施',
                      '妨害信用卡管理',
                      #'(非法)?(收购.)?(运输.)?(出售.)?(珍贵.)?(濒危)?野生动物制品',
                      #'非法猎捕、杀害珍贵、濒危野生动物',
                      #'非法收购、运输国家珍贵、濒危野生动物',
                      #'非法收购、运输国家重点保护的珍贵野生动物',
                      '野生动物',
                      '非法采伐、毁坏国家重点保护植物',
                      '破坏军婚',
                      '破坏计算机信息系统',
                      '犯?非法获取计算机信息系统数据',
                      '非法狩猎',
                      '非法采矿',
                      '非法入侵(他人)?住宅',
                      '爆炸',
                      '非法制造、买卖、储存爆炸物',
                      '骗取贷款',
                      '扰乱无线电通讯管理秩序',
                      '虚开增值税专用发票',
                      '伪证',
                      '盗掘古墓葬',
                      '侵犯公民个人信息',
                      '徇私枉法',
                      '掩饰、隐瞒犯',
                      '组织考试作弊',
                      '伪造(事业单位|公司)印章',
                      '信用卡诈骗',
                      '代替考试',
                      '组织未成年人进行违反治安管理活动',
                      '贩卖淫秽物品牟利',
                      '非国家工作人员(行|受)贿',
                      '包庇',
                      '单位行贿',
                      '掩饰隐瞒犯',
                      '逃税',
                      '防火',
                      '非法获取计算机信息系统数据',
                      '编造虚假恐怖信息',
                      '利用邪教组织破坏法律实施',
                      '诬告陷害',
                      '非法储存炸物',
                      '破坏生产经营',
                      '失职致使在押人员脱逃',
                      '虐待',
                      '使用虚假身份证件',
                      '非法处置查封的财产',
                      '购买伪造的增值税专用发票',
                      '破坏监管秩序',
                      '非法处置查封的财产',
                      '虚开抵扣发票',
                      '偷越国（边）境',
                      '妨害作证',
                      '传播淫秽物品',
                      '非法捕捞水产品',
                      '虚假诉讼',
                      '洗钱',
                      '遗弃',
                      '高利转贷',
                      '聚众冲击国家机关',
                      '国有公司人员失职',
                      '提供侵入计算机信息系统程序',
                      '提供非法控制计算机信息系统程序',
                      '国有事业单位人员失职',
                      '非法收购珍贵野生动物',
                      '非法收购、运输珍贵、濒危野生动物',
                      '危害驾驶',
                      '侵犯著作权',
                      '贩卖淫秽物品',
                      '虚报注册资本',
                      '破坏广播电视设施',
                      '过失损坏公用电信设施',
                      '非法处置查封、扣押、冻结的财产',
                      '非法处置扣押的财产',
                      '非法处置查封、扣押的财产',
                      '非法生产警用装备',
                      #'非法杀害珍贵、濒危野生动物',
                      '内幕交易',
                        '走私国家禁止进出口的货物',
                        '贩卖、制造品',
                      '非法采伐、出售国家重点保护植物']


                      
# 组织介绍卖淫
zm_group['zzjsmy_list'] = ['组织淫秽表演', '介绍、容留卖淫', '容留、介绍卖淫', '容留卖淫', '协助组织卖淫', '介绍卖淫', '组织卖淫', '\w\w卖淫']                     
#组织淫秽表演


#盗伐林木(盗伐，滥伐林木）
zm_group['dflm_list'] = ['滥伐林木', '滥发林木', '盗伐林木','非法收购、运输盗伐、滥伐的林木','非法收购盗伐、滥伐的林木','非法收购盗伐的林木','非法运输盗伐、滥伐的林木', '非法收购滥伐的林木']


#诈骗
zm_group['zp_list'] = ['集资诈骗', '合同诈骗', '诈骗', '(合同)?诈骗']

#聚众斗殴和寻衅滋事
zm_group['jzdo_xxzs_list'] = ['聚众斗殴',
                              '寻衅滋事',
                              '寻.滋事']

 
#涉枪犯罪
zm_group['sq_list'] = ['非法持有枪支',
                       '非法制造枪支',
                       '非法持有弹药',
                       '非法持有枪支、弹药',
                       '非法买卖枪支',
                       '非法持枪',
                       '非法制造、买卖枪支',
                       '非法.*(枪|弹药)',
                       '私藏枪支']
                 
                 
#交通肇事和危险驾驶
zm_group['jtzs_wxjs_list'] = [ '交通肇事', '危险驾驶',
                              '交通肇.', '险驾驶',
                              '(危)?险驾驶',
                              '危险(驾)?(驶)?',
                              '危驾']
                 
                 
#============= 具有死刑罪名的其他==================
zm_group['jysxzmdqt_list'] = ['绑架', '拐卖儿童',
                  '拐卖.?(妇女).?(儿童)?',
                  '拐骗儿童',
                  '放火',
                  '以危险方法危害公共安全'
                 ]

#贪污贿赂
zm_group['twhl_list'] = ['介绍贿赂', '受贿', '贪污']

#生产销售伪劣商品
zm_group['scxswlsp_list'] = ['生产、销售有毒食品', '假药', '有害食品', '销售伪劣产品', '生产、销售不符合安全标准的食品',
                             '生产、销售不符合安全标准食品', '生产、销售不符合食品安全标准的食品',
                             '生产、销售有毒、有害食品', '销售不符合安全标准的食品', '生产不符合安全标准的食品']




#毒品犯罪
zm_group['dpfz_list'] = ['转移毒赃', '制造毒品', '贩卖毒品', '容留他人吸毒', '非法持有毒品', '运输毒品', '非法买卖制毒物品',
                         '窝藏、转移毒品', '非法运输制毒物品', '贩卖、运输毒品', '贩卖、制造毒品',
                         '吸毒', '\w\w毒品', '贩毒', '(运输|非法买卖)制毒物品','非法持毒','贩卖毒','容留他人吸']                 
                 

                 
                 
                 
                 
sws_pattern = '(?:大邑|安县|丹棱|射洪|船山|青神|新疆|翠屏|高|攀枝花|蓬溪|通江|盐源|甘洛|普格|会东|丹巴|康定|黑水|茂县|巴中|天全|雅安|万源|渠县|大竹|达州|华蓥|眉山|仁寿|西充|营山|南部|南充|大英|井研|苍溪|剑阁|旺苍|江油|梓潼|三台|罗江|中江|合江|彭州|郫县|金堂|成都|会理|凉山|乐山|德阳|绵阳|宣汉|开江|珙县|宜宾|叙永|古蔺|泸|资中|贵阳|羌茂|金江|岷源|内江|安徽|彰正|四某|辽宁|绵竹|秦兴|剑州|黑龙江|江西|理塘|遂州|仪陇|山西|万商天勤|平昌|慧聪|筠连|甘肃|乐至|邻水|沱江|遂宁|陕西|浙江|重庆|湖|山东|X|广|云南|上海|国浩|河|北京|四川|泰|自贡|康伦|三目|平武|贵州|福建).*?(?:事务所|法律援助中心)'                 
bhr_pattern = '(宜宾|资中|贵阳|羌茂|金江|岷源|内江|安徽|彰正|四某|辽宁|绵竹|秦兴|剑州|黑龙江|江西|理塘|遂州|仪陇|山西|万商天勤|平昌|慧聪|筠连|甘肃|乐至|邻水|沱江|遂宁|陕西|浙江|重庆|湖|山东|X|广|云南|上海|国浩|河|北京|四川|泰|自贡|康伦|三目|平武|泸州|贵州|福建).*?事务所律师'


last_name = '[A|阿牛|甯|尕|安|艾|昂|庹|阚|岑|敖|雒|\
              B|奔|波|白|补|毕|布|卑|班|边|柏|贝|保|鲍|巴|包|八|宾|\
              C|程|赤|曾|晁|楚|仇|曹|成|常|蔡|陈|采|柴|淳|崔|昌|畅|车|查|此|池|串|\
              D|达|邓|旦|多|丁|窦|党|豆|地|卞|当|杜|但|董|代|登|刁|段|戴|得|\
              E|额|耳|俄|\
              F|傅|范|丰|房|扈|奉|俸|付|裴|冯|方|符|伏|樊|封|费|扶|\
              G|盖|更|弓|古|昝|耿|芶|国|关|葛|共|官|瓜|广|谷|勾|郜|龚|干|贵|管|眭|苟|果|顾|桂|高|郭|甘|戈|宫|辜|巩|格|\
              H|花|户|洪|瑚|回|惠|缑|衡|何|华|黄|郝|韩|侯|胡|霍|奂|候|贺|赫|黑|海|\
              I|\
              J|冮|嘉|降|金|敬|蒋|姜|巨|贾|靳|呷|季|焦|景|吉|戢|谯|劼|井|江|晋|甲木|简|鞠|纪|计|淦|\
              K|柯|克|坤|江|矿|旷|寇|邝|况|康|孔|匡|亢|卡|\
              L|令狐|廉|兰|缪|路|练|娄|洛|闾|骆|蓝|鲁|勒吾|栾|隆|柳|郎|虞|连|芦|凌|林|楼|黎|罗|陆|赖|龙|卢|李|冷|吕|廖|刘|梁|雷|\
              M|麻|苗|马|蒙|门|满|明|庙|牟|梅|米|莫|穆|母|糜|闵|孟|毛|曼|\
              N|努|倪|聂|尼玛|宁|佀|\
              O|欧|鸥|\
              P|皮|彭|潘|普|庞|濮|蒲|泡|卜|\
              Q|秦|钱|秋|切|祁|权|阙|青|且|齐|戚|卿|漆|瞿|屈|覃|蹇|全|邱|乔|\
              R|冉|任|容|荣|茹|仁|尧|饶|阮|芮|\
              S|单|苏|寿|宿|山|厍|盛|色|松|粟|舒|石|申|首|双|师|税|佘|史|索|商|尚|孙|桑|施|司|四|赛|沈|邵|沙|宋|帅|什|\
              T|谭|吐|屠|谈|塔|滕|腾|汤|土|田|唐|童|涂|凃|铁|陶|佟|图|\
              W|万|枉|伟|文|汪|卫|乌|闻|魏|巫|危|伍|邬|温|武|韦|王|吴|宛|翁|旺|\
              X|宣|项|萧|咸|奚|席|谢|辛|幸|先|旭|解|习|霞|鲜|邢|薛|修|宪|向|肖|夏|徐|许|熊|\
              Y|院|燕|阴|银|衣|依|月|洋|英|医|怡|弋|亿|仰|应|姚|禹|尤|云|闫|乐|宇|约|庾|苑|严|阎|羊|尹|亚|夭|游|俞|余|叶|胥|袁|雍|阳|易|岳|殷|晏|鄢|颜|喻|杨|扬|\
              Z|翟|联|宗|査|志|支|诸|褚|谌|臧|占|卓|植|正|资|张|祖|赵|邹|章|仲|甄|詹|竹|祝|庄|左|周|朱|郑|泽|钟|扎]'
#曾经，户籍，宣告              
ss_name = '(火补色拉|曲木什古|麦麦提艾力·艾孜拉|瓦扎阿作|王某甲王某|萨德|西热艾力.苏勒坦|加毛|哈马莫吉杂|萨博|拉衣瓦布|艾孜孜•吐热普|呷绒邓邓|买买提力·艾买尔|格绒平错|拉马火尔|曲某|日力俄洛|结字伍干莫|赤黑某甲|乃保某甲|乃古么勇扎|泥玛仁清|艾克拜尔·麦麦提|西仁次仁|次甲|\
赤黑日沙|曲木木此歪|能子么外子|依力哈某·某某某|伊某某某·某某某某某|阿卜杜力穆太力普·阿吉|拉机五加|哈马里呷|麦合木提尼亚孜·库尔班|日嘿日且|马合木提·麦麦提|赤黑扯沙|阿卜杜凯由木·巴斯提拉古丽|吉火么尔阿木|\
喀迪尔•艾麦提|呷马五各|日火有古么|都光夜|夺尔单|神杂某一|阿力木·麦麦提|日阿木|的地吉哈|迪某某.某|恩扎|阿迪力江·牙森|热娜古丽•图尔贡|三郎XXX|比尔加加木|曲木阿木|阿初莫伟作|\
麦某某某|洛某某某|俄的拉根|阿卜力孜•加帕尔|艾某某某|努某某某|库尔班•热合曼|博史呷嘿|三郎石旦真|来来支布|瓦扎吃古莫|苏呷阿尔|阿布都维力﹒亚库普|黑呷阿木|马查么子扎|\
降泽|多杰才仁|多吉仁珍|呷然|扎西降泽|联保么你作|俄果布则|使掌某甲|珍珠让布|联保么某甲|子尔么木作|基批某某|平西什西木|足窝某某|尔某某|尔某某某|\
跑查莫里洛|凉都么力火|拖觉某某|初布某某|南征某某|麻卡某某|纳黑莫某某|倮古某某某|生吞如洛|杰都某某|威色某某|尔布医生|伊斯马伊力·某某某|\
甫哇甲|次仁降村|摩西罗立|立牛罗西|哈拉扎西某某|水罗彝古|耍惹石叶|切吉史者|菜呷日|供某某|贡呷扎西|东周甲木措|艾克拜尔·阿卜都外力|曲别春丽|\
甲布德珠|更尕泽让|加瓦木及|日火莫布洛|夏克尔·艾合麦提|海来阿三|阿卜力米提﹒喀迪尔|阿布都卡地尔·吐儿孙|搏什么次作|保格日方|艾沙·吾四曼|瓦尔某某|\
黑乃拉曲|俄木尔呷|吉差五呷木|马合木提•麦麦提|瓦尔木牛|ＸＸ|依米提斯拉木•吾斯曼|嘿哈么某某|勤别某某|拉日古史|格尔某某|加XXX|尔组伍合|\
HOANGTHINGHIA|PHAMQUANGDAT|TAXUANNAM|LECONGHOANG|DANGTHANHTUNG|艾亥提·阿布来提|胜扎么某某|博什么某某|买买提·某某某|都仁某某|\
的日某1|的日某2|巧吉沙尔|以很三哥|扎西多吉|惹及拉格|玉苏普•艾合麦提|热依沙·开里木|小木几|召布有日|马某某·如则某某某|热某某某|\
努尔艾力•麦麦提|说日某某|买买提伊|洛古木衣|火布日拉|体哈某某|赤黑么某某|那木么日则|尾什么土各|窝比么扭各|艾热克尼·某某某某某某|\
红什某某某|黑吉尔果么|米色沙作|CHUNGJIWOONG|邛莫挖长|邛莫广长|邛莫广州|邛莫支付|邛莫小明|邛莫根美|邛莫乡长|邛莫支也|邛莫军军|邛莫者林|\
耍日取布|立立曲铁|曲别木铁|枯以格)'              
#|送|本|刀|将|时||把||起未|于
invalide_name = '(把德君|求某|于某|于斌|李\*|则周|无名氏|侯映华|高举太|谢某|陈梁|李贵林|龙天旭|肉孜尼萨·卡地尔|玛伊努尔·阿卜杜拉|的某某|和某某|起应忠|都建波|买某某|都某某|拉某|开某某|来任重|说泽|来某|某某|从兆存|降错|直巴|未生生|未大彬|未平|马＊)'