# -*- 'coding',: 'UTF',-'8', -*-



#'zhongji',
court_list = {'chengdu':'',
              'zigong':'',
              'panzhihua':'',
              'luzhou':'',
              'deyang':'',
              'mianyang':'',
              'guangyuan':'',
              'shuining':'',
              'neijiang':'',
              'leshan':'',
              'nanchong':'',
              'meishan':'',
              'yibing':'',
              'guangan':'',
              'dazhou'
              'yaan':'',
              'bazhong':'',
              'ziyang':'',
              'wenchuan':'',
              'kangding':'',
              'xichang':'',
              'tielu':''}

#court_list['zhongji'] = ['四川省成都市中级人民法院',
#                        '四川省自贡市中级人法院',
#'四川省攀枝花市中级人民法院',
#'四川省泸州市中级人民法院',
#'四川省德阳市中级人民法院',
#'四川省绵阳市中级人民法院',
#'四川省广元市中级人民法院',
#'四川省遂宁市中级人民法院',
#'四川省内江市中级人民法院',
#'四川省乐山市中级人民法院',
#'四川省南充市中级人民法院',
#'四川省眉山市中级人民法院',
#'四川省宜宾市中级人民法院',
#'四川省广安市中级人民法院',
#'四川省达州市中级人民法院',
#'四川省雅安市中级人民法院',
#'四川省巴中市中级人民法院',
#'四川省资阳市中级人民法院',
#'四川省阿坝藏族羌族自治州中级人民法院',
#'四川省甘孜藏族自治州中级人民法院',
#'四川省凉山彝族自治州中级人民法院',
#'成都铁路运输中级法院']


court_list['chengdu'] = ['成都市锦江区人民法院',
'成都市青羊区人民法院',
'成都市金牛区人民法院',
'成都市武侯区人民法院',
'成都市成华区人民法院',
'成都市龙泉驿区人民法院',
'成都市青白江区人民法院',
'成都市温江区人民法院',
'金堂县人民法院',
'成都市双流区人民法院',
'郫县人民法院',
'大邑县人民法院',
'蒲江县人民法院',
'新津县人民法院',
'都江堰市人民法院',
'彭州市人民法院',
'邛崃市人民法院',
'崇州市人民法院',
'成都高新技术产业开发区人民法院']

court_list['zigong'] = ['自贡市自流井区人民法院',
'自贡市贡井区人民法院',
'自贡市大安区人民法院',
'自贡市沿滩区人民法院',
'荣县人民法院',
'富顺县人民法院']

court_list['panzhihua'] = ['攀枝花市东区人民法院',
'攀枝花市西区人民法院',
'攀枝花市仁和区人民法院',
'米易县人民法院',
'盐边县人民法院']

court_list['luzhou'] = ['泸州市江阳区人民法院',
'泸州市纳溪区人民法院',
'泸州市龙马潭区人民法院',
'泸县人民法院',
'合江县人民法院',
'叙永县人民法院',
'古蔺县人民法院']

court_list['deyang'] = ['德阳市旌阳区人民法院',
'中江县人民法院',
'罗江县人民法院',
'广汉市人民法院',
'什邡市人民法院',
'绵竹市人民法院']

court_list['mianyang'] = ['绵阳市涪城区人民法院',
'绵阳市游仙区人民法院',
'三台县人民法院',
'盐亭县人民法院',
'绵阳市安州区人民法院',
'梓潼县人民法院',
'北川羌族自治县人民法院',
'平武县人民法院',
'江油市人民法院',
'四川省科学城人民法院',
'绵阳高新技术产业开发区人民法院']

court_list['guangyuan'] = ['广元市利州区人民法院',
'广元市昭化区人民法院',
'广元市朝天区人民法院',
'旺苍县人民法院',
'青川县人民法院',
'剑阁县人民法院',
'苍溪县人民法院']

court_list['shuining'] = ['遂宁市船山区人民法院',
'遂宁市安居区人民法院',
'蓬溪县人民法院',
'射洪县人民法院',
'大英县人民法院']

court_list['neijiang'] = ['内江市市中区人民法院',
'内江市东兴区人民法院',
'威远县人民法院',
'资中县人民法院',
'隆昌县人民法院']

court_list['leshan'] = ['乐山市市中区人民法院',
'乐山市沙湾区人民法院',
'乐山市五通桥区人民法院',
'乐山市金口河区人民法院',
'犍为县人民法院',
'井研县人民法院',
'夹江县人民法院',
'沐川县人民法院',
'峨边彝族自治县人民法院',
'马边彝族自治县人民法院',
'峨眉山市人民法院']


court_list['nanchong'] = ['南充市顺庆区人民法院',
'南充市高坪区人民法院',
'南充市嘉陵区人民法院',
'南部县人民法院',
'营山县人民法院',
'蓬安县人民法院',
'仪陇县人民法院',
'西充县人民法院',
'阆中市人民法院']


court_list['meishan'] = ['眉山市东坡区人民法院',
'眉山市彭山区人民法院',
'仁寿县人民法院',
'洪雅县人民法院',
'丹棱县人民法院',
'青神县人民法院']

court_list['yibing'] = ['宜宾市翠屏区人民法院',
'宜宾市南溪区人民法院',
'宜宾县人民法院',
'江安县人民法院',
'长宁县人民法院',
'高县人民法院',
'珙县人民法院',
'筠连县人民法院',
'兴文县人民法院',
'屏山县人民法院']

court_list['guangan'] = ['广安市广安区人民法院',
'广安市前锋区人民法院',
'岳池县人民法院',
'武胜县人民法院',
'邻水县人民法院',
'华蓥市人民法院']

court_list['dazhou'] = ['达州市通川区人民法院',
'达州市达川区人民法院',
'宣汉县人民法院',
'开江县人民法院',
'大竹县人民法院',
'渠县人民法院',
'万源市人民法院']

court_list['yaan'] = ['雅安市雨城区人民法院',
'雅安市名山区人民法院',
'荥经县人民法院',
'汉源县人民法院',
'石棉县人民法院',
'天全县人民法院',
'芦山县人民法院',
'宝兴县人民法院']

court_list['bazhong'] = ['巴中市巴州区人民法院',
'巴中市恩阳区人民法院',
'通江县人民法院',
'南江县人民法院',
'平昌县人民法院']

court_list['ziyang'] = ['资阳市雁江区人民法院',
'安岳县人民法院',
'乐至县人民法院',
'简阳市人民法院']

court_list['wenchuan'] = ['汶川县人民法院',
'理县人民法院',
'茂县人民法院',
'松潘县人民法院',
'九寨沟县人民法院',
'金川县人民法院',
'小金县人民法院',
'黑水县人民法院',
'马尔康市人民法院',
'壤塘县人民法院',
'阿坝县人民法院',
'若尔盖县人民法院',
'红原县人民法院']

court_list['kangding'] = ['康定市人民法院',
'泸定县人民法院',
'丹巴县人民法院',
'九龙县人民法院',
'雅江县人民法院',
'道孚县人民法院',
'炉霍县人民法院',
'甘孜县人民法院',
'新龙县人民法院',
'德格县人民法院',
'白玉县人民法院',
'石渠县人民法院',
'色达县人民法院',
'理塘县人民法院',
'巴塘县人民法院',
'乡城县人民法院',
'稻城县人民法院',
'得荣县人民法院']

court_list['xichang'] = ['西昌市人民法院',
'木里藏族自治县人民法院',
'盐源县人民法院',
'德昌县人民法院',
'会理县人民法院',
'会东县人民法院',
'宁南县人民法院',
'普格县人民法院',
'布拖县人民法院',
'金阳县人民法院',
'昭觉县人民法院',
'喜德县人民法院',
'冕宁县人民法院',
'越西县人民法院',
'甘洛县人民法院',
'美姑县人民法院',
'雷波县人民法院']

court_list['tielu'] = ['成都铁路运输法院',
'西昌铁路运输法院']

